src/conf/Documents/уп_Сделка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>уп_Сделка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиПроцедур</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоЗанятий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СКемЗаключенДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПроцедур</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Процедура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/conf/Documents/уп_Сделка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Элементы.СКемЗаключенДоговор.СписокВыбора.Очистить();
	Элементы.СКемЗаключенДоговор.СписокВыбора.ЗагрузитьЗначения(ПолучитьОтветственныхПоКлиенту());
КонецПроцедуры

&НаСервере
Функция ПолучитьОтветственныхПоКлиенту()
	МассивОтветственных = Новый Массив;
	Если НЕ Объект.Клиент.Пустая() Тогда 
		Если ЗначениеЗаполнено(Объект.Клиент.Отец) Тогда
			МассивОтветственных.Добавить(Объект.Клиент.Отец);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Клиент.Мать) Тогда
			МассивОтветственных.Добавить(Объект.Клиент.Мать);
		КонецЕсли;
	КонецЕсли;
	Возврат МассивОтветственных;
КонецФункции

&НаКлиенте
Процедура СКемЗаключенДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(ПолучитьОтветственныхПоКлиенту());
КонецПроцедуры
